In [1]:
# Load library
import pandas as pd

In [2]:
# Create URL
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

In [3]:
# Load data
dataframe = pd.read_csv(url)

In [4]:
## Select missing values, show two rows
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [5]:
# Load library
import numpy as np

In [6]:
# Replace values with NaN
dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)

In [7]:
# Load data, set missing values
dataframe = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

In [8]:
# Get a single null row
null_entry = dataframe[dataframe["Age"].isna()].head(1)

In [9]:
# Fill all null values with the mean Age of passengers
null_entry.fillna(dataframe["Age"].mean())

                            Name PClass        Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  30.397989  female         1        1